In [18]:
import pandas as pd

### There are two core objects in pandas: the DataFrame and the Series.
- DataFrame is a table. It contains an array of individual entries, each of which has a certain value. Each entry corresponds to a row (or record) and a column.
- Series is a sequence of data values. If a DataFrame is a table, a Series is a list.

In [19]:
pd.DataFrame({
    'Name': ['John', 'Emma', 'Michael', 'Sarah', 'David'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['New York', 'London', 'Paris', 'Tokyo', 'Berlin'],
    'Salary': [50000, 60000, 75000, 55000, 65000],
    'Department': ['Sales', 'IT', 'Marketing', 'HR', 'Finance']
})

      Name  Age      City  Salary Department
0     John   25  New York   50000      Sales
1     Emma   30    London   60000         IT
2  Michael   35     Paris   75000  Marketing
3    Sarah   28     Tokyo   55000         HR
4    David   32    Berlin   65000    Finance

In [20]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', '']})

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.

In [21]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', '']}, index=['Product A', 'Product B'])

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.

In [22]:
pd.Series([1, 2, 3, 4, 5]) # A Series is, in essence, a single column of a DataFrame

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [23]:
pd.Series([12321,321321,78978], index=['a','b','c'])

a     12321
b    321321
c     78978
dtype: int64

In [24]:
data=pd.read_csv('data.csv')
data

              Name  Age           City         Occupation  Salary
0       John Smith   34       New York  Software Engineer   95000
1    Sarah Johnson   28    Los Angeles  Marketing Manager   75000
2    Michael Brown   45        Chicago     Sales Director  120000
3      Emily Davis   31        Houston       Data Analyst   65000
4     David Wilson   39         Boston    Product Manager   85000
5    Lisa Anderson   29        Seattle        UX Designer   70000
6     James Taylor   42          Miami  Financial Advisor   98000
7  Jennifer Martin   36  San Francisco         HR Manager   82000
8    Robert Garcia   33         Austin    Systems Analyst   72000

In [25]:
data.shape # (rows, columns)

(9, 5)

In [26]:
pd.read_csv('data.csv', index_col=3).head()

                            Name  Age         City  Salary
Occupation
Software Engineer     John Smith   34     New York   95000
Marketing Manager  Sarah Johnson   28  Los Angeles   75000
Sales Director     Michael Brown   45      Chicago  120000
Data Analyst         Emily Davis   31      Houston   65000
Product Manager     David Wilson   39       Boston   85000